<a href="https://colab.research.google.com/github/PriankaKibria17/Priankas_Coding/blob/main/Pandas_Exercises_on_the_Titanic_Dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Pandas Exercises on the Titanic Dataset

Prianka Kibria

3/3/22

In [ ]:
# mounting
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
# imports
import pandas as pd
import numpy as np

In [ ]:
# loading my data
filename = '/content/drive/MyDrive/data/titanic (1).csv'
titanic_df = pd.read_csv(filename)

Display the head of the dataframe.

In [ ]:
# displaying the head of the titanic data using .head()
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

What is the percentage of people who survived? (hint: find the mean of the survival column).

In [ ]:
# obtaining the mean of the survival column and naming it 'survivors'
survivors = titanic_df['Survived'].mean()*100
print('The percentage of those who survived is:', survivors)

The percentage of those who survived is: 38.38383838383838

How many of each sex survived?

In [ ]:
# filtering survivals only 
#naming it survival filter
survival_filter = titanic_df['Survived']==1

In [ ]:
#using groupby method to obtain survival rate for sexes
titanic_df.groupby('Sex')['Survived'].sum()

Sex
female    233
male      109
Name: Survived, dtype: int64

Considering only the group of passengers who paid less than $10, what percentage of this group survived?

In [ ]:
# filtering those who paid less than 10 and getting the mean
ten_less = titanic_df['Fare'] < 10
titanic_df.loc[ten_less].groupby('Survived')['Fare'].mean()

Survived
0    7.446914
1    7.788064
Name: Fare, dtype: float64

In [ ]:
#Converting into percentages
titanic_df.loc[ten_less].groupby('Survived')['Fare'].mean()*100

Survived
0    744.691450
1    778.806418
Name: Fare, dtype: float64

Overall, what is the average age of those who didn't survive?

In [ ]:
# filtering age ~ to filter those who did not survive(reverse the survival_filter)
#obtained average 
titanic_df.loc[~survival_filter,'Age'].mean()

30.62617924528302

Overall, what is the average age of those who did survive?

In [ ]:
#filtering those who did survive and obtaining average
titanic_df.loc[survival_filter, 'Age'].mean()

28.343689655172415

What is the average age of those who did and didn't survive grouped by Sex?

In [ ]:
# filtering by grouping columns sex age and survived and getting the average
titanic_df.groupby(['Sex', 'Survived'])['Age'].mean()

Sex     Survived
female  0           25.046875
        1           28.847716
male    0           31.618056
        1           27.276022
Name: Age, dtype: float64